
# 姓氏top100
xing = list("王,张,李,刘,陈,杨,黄,周,胡,赵,吴,徐,宋,林,朱,孙,高,曹,郭,马,罗,何,梁,谢,韩,郑,于,唐,董,夏,傅,冯,袁,彭,许,姚,汪,曾,江,薛,苏,卢,叶,廖,余,魏,邓,杜,阎,丁,潘,肖,戴,毛,钟,谭,田,任,姜,范,方,贾,蔡,程,沈,邹,熊,金,陆,郝,蒋,白,崔,康,吕,邱,秦,汤,石,史,顾,侯,邵,孟,龙,万,段,莫,钱,孔,尹,黎,易,常,武,乔,贺,赖,龚,文".split(","))

# 姓氏top20
xing = list("王,张,李,刘,陈,杨,黄,周,胡,赵,吴,徐,宋,林,朱,孙,高,曹,郭,马".split(","))

ming = list("一诺,丹,丽,伟,佳怡,俊杰,倩,兰英,军,凤英,刚,勇,和平,国华,娜,娟,婷,婷婷,子涵,子豪,子轩,宇,宇航,宇轩,帅,平,建军,建华,建国,建平,强,徳明,志明,悦,敏,斌,明,杰,桂兰,桂英,梓宣,梓涵,欣怡,波,浩,浩宇,浩然,浩轩,涛,燕,玉兰,玉梅,玉珍,玉英,玲,皓轩,磊,秀兰,秀珍,秀英,紫涵,红,红梅,艳,芳,英,萍,诗涵,超,辉,鑫,雨欣,雨涵,雪,霞,静,颖,鹏".split(","))

for x in xing:
    for m in ming:
        print(x+m)